<a href="https://colab.research.google.com/github/majay777/htmlexample/blob/main/Untitled2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("/content/MarketArrivals.csv")

In [ ]:
df.index

RangeIndex(start=0, stop=10227, step=1)

In [ ]:
df.columns

Index(['market', 'month', 'year', 'quantity', 'priceMin', 'priceMax',
       'priceMod', 'state', 'city', 'date'],
      dtype='object')

In [ ]:
df['market'].value_counts().head(1)

LASALGAON(MS)    242
Name: market, dtype: int64

In [ ]:
df['market','quantity'].value_counts()

KeyError: ignored

In [ ]:
df['state'].value_counts().unique()

array([4354,  958,  929,  617,  593,  462,  350,  309,  278,  233,  187,
        163,  158,  140,  134,  129,  123,   55,   40,   13,    2])

In [ ]:
df_sm = df.loc[:,['market','state']].value_counts()

In [ ]:
df_sm.drop_duplicates(inplace=True)

In [ ]:
df_sm.head()

market          state
LASALGAON(MS)   MS       242
PIMPALGAON(MS)  MS       224
MANMAD(MS)      MS       218
LONAND(MS)      MS       211
MAHUVA(GUJ)     GUJ      210
dtype: int64

In [ ]:
df_sm

market           state
LASALGAON(MS)    MS       242
PIMPALGAON(MS)   MS       224
MANMAD(MS)       MS       218
LONAND(MS)       MS       211
MAHUVA(GUJ)      GUJ      210
                         ...
MADURAI(TN)      TN         6
NANDGAON(MS)     MS         5
GORAKHPUR(UP)    UP         3
SRIRAMPUR(MS)    MS         2
CHALLAKERE(KNT)  KNT        1
Length: 71, dtype: int64

In [ ]:
df_sm = df.loc[:,['state','market']]

In [ ]:
df_sm

      state      market
0        PB  ABOHAR(PB)
1        PB  ABOHAR(PB)
2        PB  ABOHAR(PB)
3        PB  ABOHAR(PB)
4        PB  ABOHAR(PB)
...     ...         ...
10222    MS   YEOLA(MS)
10223    MS   YEOLA(MS)
10224    MS   YEOLA(MS)
10225    MS   YEOLA(MS)
10226    MS   YEOLA(MS)

[10227 rows x 2 columns]

In [ ]:
df1 = df.loc[:,['market','state']]

In [ ]:
df1

           market state
0      ABOHAR(PB)    PB
1      ABOHAR(PB)    PB
2      ABOHAR(PB)    PB
3      ABOHAR(PB)    PB
4      ABOHAR(PB)    PB
...           ...   ...
10222   YEOLA(MS)    MS
10223   YEOLA(MS)    MS
10224   YEOLA(MS)    MS
10225   YEOLA(MS)    MS
10226   YEOLA(MS)    MS

[10227 rows x 2 columns]

In [ ]:
df['market'],['state'],['market']

(0        ABOHAR(PB)
 1        ABOHAR(PB)
 2        ABOHAR(PB)
 3        ABOHAR(PB)
 4        ABOHAR(PB)
             ...
 10222     YEOLA(MS)
 10223     YEOLA(MS)
 10224     YEOLA(MS)
 10225     YEOLA(MS)
 10226     YEOLA(MS)
 Name: market, Length: 10227, dtype: object, ['state'], ['market'])

In [ ]:
df

           market     month  year  ...  state    city           date
0      ABOHAR(PB)   January  2005  ...     PB  ABOHAR   January-2005
1      ABOHAR(PB)   January  2006  ...     PB  ABOHAR   January-2006
2      ABOHAR(PB)   January  2010  ...     PB  ABOHAR   January-2010
3      ABOHAR(PB)   January  2011  ...     PB  ABOHAR   January-2011
4      ABOHAR(PB)   January  2012  ...     PB  ABOHAR   January-2012
...           ...       ...   ...  ...    ...     ...            ...
10222   YEOLA(MS)  December  2011  ...     MS   YEOLA  December-2011
10223   YEOLA(MS)  December  2012  ...     MS   YEOLA  December-2012
10224   YEOLA(MS)  December  2013  ...     MS   YEOLA  December-2013
10225   YEOLA(MS)  December  2014  ...     MS   YEOLA  December-2014
10226   YEOLA(MS)  December  2015  ...     MS   YEOLA  December-2015

[10227 rows x 10 columns]

In [ ]:
uniq_market=df.drop_duplicates(subset=['market'])
uniq_market.groupby(['state'])['market'].count().reset_index().sort_values(by='market',ascending=False).head(1)

   state  market
14    MS      38

Empty DataFrame
Columns: [market, month, year, quantity, priceMin, priceMax, priceMod, state, city, date]
Index: []

In [ ]:
df_ls = df.loc[df['market'] == 'LASALGAON(MS)']

In [ ]:
df_ls

             market     month  year  ...  state       city           date
5399  LASALGAON(MS)   January  1996  ...     MS  LASALGAON   January-1996
5400  LASALGAON(MS)   January  1997  ...     MS  LASALGAON   January-1997
5401  LASALGAON(MS)   January  1998  ...     MS  LASALGAON   January-1998
5402  LASALGAON(MS)   January  1999  ...     MS  LASALGAON   January-1999
5403  LASALGAON(MS)   January  2000  ...     MS  LASALGAON   January-2000
...             ...       ...   ...  ...    ...        ...            ...
5636  LASALGAON(MS)  December  2011  ...     MS  LASALGAON  December-2011
5637  LASALGAON(MS)  December  2012  ...     MS  LASALGAON  December-2012
5638  LASALGAON(MS)  December  2013  ...     MS  LASALGAON  December-2013
5639  LASALGAON(MS)  December  2014  ...     MS  LASALGAON  December-2014
5640  LASALGAON(MS)  December  2015  ...     MS  LASALGAON  December-2015

[242 rows x 10 columns]

In [ ]:
df.groupby(['market','year']) ['priceMax'].max()

market      year
ABOHAR(PB)  2005    1370
            2006     638
            2007    1650
            2009    1818
            2010    3344
                    ...
YEOLA(MS)   2012    1327
            2013    5038
            2014    2246
            2015    4841
            2016    1272
Name: priceMax, Length: 1091, dtype: int64

In [ ]:
df_ls.groupby(['year'])['priceMax'].max()

Series([], Name: priceMax, dtype: int64)